/* 
  KPKLocalizable.strings
  MacPass

  Created by Michael Starke on 20/12/13.
  Copyright (c) 2013 HicknHack Software GmbH. All rights reserved.
*/

"SET_TITLE" = "Editar Título";
"SET_USERNAME" = "Editar Nombre de Usuario";
"SET_PASSWORD" = "Editar Contraseña";
"SET_URL" = "Editar URL";
"SET_NOTES" = "Editar Notas";

"DATABASE" = "Base de Datos";
"EMAIL" = "EMail";
"GENERAL" = "General";
"HOMEBANKING" = "Bancos";
"INTERNET" = "Internet";
"NETWORK" = "Red";
"TRASH" = "Papelera";
"WINDOWS" = "Windows";

/* Copy */
"KPK_GROUP_COPY_%@" = "Copia %@";
"KPK_ENTRY_COPY_%@" = "Copia %@";

/* Validation Errors */
"ERROR_WINDOW_TITLE_VALIDATION_FAILED" = "El formato del título no es válido.";
"ERROR_ATTRIBUTE_KEY_VALIDATION_FAILED" = "La llave de atributo no es única.";
"ERROR_AUTOTYPE_SEQUENCE_VALIDATION_FAILED" = "La secuenta de Autotype no es válida.";

/* Errors */
"ERROR_CORRUPT_TREE" = "La estructura interna del archivo está corrupta.";
"ERROR_INVALID_FIELD_SIZE" = "La longitud del campo no es válida. ¿Contraseña incorrecta?";
"ERROR_INVALID_FIELD_TYPE" = "Valor desconocido. ¿Contraseña incorrecta?";
"ERROR_UNSUPPORTED_DATABASER_VERSION" = "La versión de la base de datos no es soportada.";
"ERROR_UNSUPPORTED_CHIPHER" = "Algoritmo de encriptación no soportado";
"ERROR_UNKNOWN_FILE_FORMAT" = "Formato de archivo desconocido";
"ERROR_HEADER_CORRUPTED" = "Cabecera corrupta";
"ERROR_UNSUPPORTED_KDBX_COMPRESSION_ALGORITHM" = "Algoritmo de compresión no soportado";
"ERROR_UNSUPPORTED_KDBX_RANDOM_STREAM" = "Tipo de random stream no soportado";
"ERROR_INTEGRITY_CHECK_FAILED" = "No se puede verificar la integridad de la base de datos";
"ERROR_PASSWORD_OR_KEYFILE_WRONG" = "La contraseña o el KeePassFile son incorrectos";
"ERROR_KEEPASSFILE_ELEMENT_MISSING" = "El archivo XML no contiene el elemento KeePassFile";
"ERROR_ROOT_ELEMENT_MISSING" = "El archivo XML no contiene el nodo Root";
"ERROR_GROUP_ELEMENT_MISSING" = "El archivo XML no contiene el nodo Group";
"ERROR_HEADER_HASH_MISSMATCH" = "El hash del header no coincide. Archivo corrupto";
"ERROR_XML_KEYFILE_WITHOUT_KEY_ELEMENT" = "El archivo XML no contiene el elemento key";
"ERROR_XML_KEYFILE_WITHOUT_DATA_ELEMENT" = "El archivo XML no contiene el elemento data";
"ERROR_XML_KEYFILE_DATA_PARSING_ERROR" = "No es posible leer la información del archivo XML.";
"ERROR_HEADER_HASH_VERIFICATION_FAILED" = "El hash de la cabecera de la base de datos es incorrecto. La integridad puede estar en riesgo.";
